{
  "meta": {
    "theme": "kendall",
    "canonical": "https://github.com/paskal/resume/blob/master/resume.json"
  },
  "basics": {
    "name": "Dmitry Verkhoturov",
    "label": "Senior Site Reliability Engineer",
    "image": "",
    "email": "paskal.07@gmail.com",
    "phone": "+31645790406",
    "birth": {
      "date": "1991-03-24"
    },
    "summary": "I am passionate about meaningful alerting and monitoring, troubleshooting, automation, and reliability. I have extensive knowledge of Linux internals, networking, and system design. I primarily work with bare-metal and generic cloud services from all major providers, focusing on those that are safe from vendor lock-ins, such as EC2 and S3. At this point in my career, I consider myself a cloud builder rather than a cloud user.<br />In recent years, I have been programming mainly in Go, and you can find much of my work on my GitHub, https://github.com/paskal. Additionally, I can write code in Python, TypeScript, and Shell and maintain and build upon code written in Ruby, Perl, PHP, and Java.<br />I thrive in high-ambiguity and chaotic environments, where I need to figure out the goals and ways to achieve them. I require significant responsibility and substantial problems on the horizon to maintain interest in my work.<br />I have three and a half years of team management experience, and I prefer leading over managing, with a strong focus on mentoring and succeeding together. My peers regard me as a skilled negotiator, and I have a history of finding workable compromises for cross-team issues.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Amsterdam",
      "countryCode": "NL",
      "region": ""
    },
    "profiles": [
      {
        "network": "StackOverflow",
        "username": "Dmitry Verkhoturov",
        "url": "https://stackexchange.com/users/931242/dmitry-verkhoturov?tab=accounts"
      },
      {
        "network": "GitHub",
        "username": "paskal",
        "url": "https://github.com/paskal"
      },
      {
        "network": "LinkedIn",
        "username": "Dmitry Verkhoturov",
        "url": "https://www.linkedin.com/in/verhoturov/"
      }
    ]
  },
  "work": [
    {
      "name": "Booking.com",
      "position": "Senior Site Reliability Engineer, ABU Reliability",
      "url": "https://www.booking.com/",
      "startDate": "2022-04-01",
      "location": "Amsterdam",
      "summary": "Booking.com is a leading internet travel company by market capitalization. I currently work in the Accommodations BU, which is responsible for the main services used by our customers and partners.",
      "highlights": [
        "Elevating reliability standards across the company's most significant and oldest revenue-generating department.",
        "Building a team and processes to scale from two to nine people.",
        "Conducted over 100 technical interviews in 2022, contributing to finding new colleagues and improving the process with feedback and question adjustments.",
        "Participating in on-call shifts at team and department levels and in groups responsible for Booking.com's site operations.",
        "Contributing weekly tweaks to processes, code, and documentation within my reach across the company. Ranked among the company's top 5 Puppet code contributors each year, starting with the first one.",
        "Improving the Engineering promotions process alongside Engineering leadership, sharing knowledge about preparation for promotions with peers, and conducting peer case review groups with dozens of participants."
      ]
    },
    {
      "name": "Booking.com",
      "position": "Senior Site Reliability Engineer, Private Cloud Adoption",
      "url": "https://www.booking.com/",
      "startDate": "2021-04-01",
      "endDate": "2022-03-31",
      "location": "Amsterdam",
      "summary": "During that year, I became responsible for onboarding the first major internal customers to the Private Cloud platform. The foundation was 95% ready, but we had to modify it according to customers' requirements and build a layer of APIs and interfaces to integrate vendor products with internal systems. I left the team after dedicated EM and TPM took over most of my responsibilities, and my scope was significantly reduced.",
      "highlights": [
        "Wore my TPM hat, led negotiations with customers, and ensured that the project was mainly on track, while the team of seven people focused on tasks that got us closer to the goal.",
        "Wrote and reviewed a dozen Architecture Design Records, addressing the challenge of managing complexity and distributing it between customers and us, and within services and logical layers on our side.",
        "The team had outstanding technical capabilities, allowing me to focus on development direction and building trust with customers."
      ]
    },
    {
      "name": "Booking.com",
      "position": "Site Reliability Engineer, Image Service and Email Infrastructure",
      "url": "https://www.booking.com/",
      "startDate": "2020-07-01",
      "endDate": "2021-03-31",
      "location": "Amsterdam",
      "summary": "For a year, I was responsible for image serving and transactional email delivery infrastructure.",
      "highlights": [
        "Reduced Keep The Lights On activities (e.g., maintenance and toil not contributing to the product) from 90% to 60% within two teams I worked with and one sister team, primarily through automation.",
        "Drove migration from a pet to cattle approach to infrastructure for multiple teams and helped them decrease the noise-to-signal alerting ratio."
      ]
    },
    {
      "name": "Booking.com",
      "position": "Site Reliability Engineer, Cloud Security",
      "url": "https://www.booking.com/",
      "startDate": "2019-03-01",
      "endDate": "2020-06-30",
      "location": "Amsterdam",
      "summary": "For the first year and a half, I provided security guardrails for cloud migration, aiming to create a secure yet functional cloud environment for internal customers. My contributions included researching and implementing technical measures for SOx compliance and auditability, as well as keeping up with the work of hundreds of developers.",
      "highlights": []
    },
    {
      "name": "IPonWeb",
      "position": "Senior DevOps Engineer, BidSwitch",
      "url": "https://www.bidswitch.com/",
      "startDate": "2018-08-01",
      "endDate": "2019-02-28",
      "location": "Moscow",
      "summary": "BidSwitch, a product of IPonWeb, facilitates participation in RTB auctions with numerous partners, minimizing technical efforts and optimizing advertising budgets. I joined the team to tackle new challenges and familiarize myself with technologies such as Jenkins, Groovy, GitLab, Kubernetes, and Helm.<br />My accomplishments included setting up Prometheus monitoring for team infrastructure, writing Groovy code and tests, and developing numerous internal and open-source Helm charts.",
      "highlights": []
    },
    {
      "name": "IPonWeb",
      "position": "Monitoring Team Lead",
      "url": "https://www.iponweb.com/",
      "startDate": "2015-02-01",
      "endDate": "2018-07-30",
      "location": "Moscow",
      "summary": "IPonWeb, a 300+ employee company, provides technology for the advertising industry, particularly Real-Time Bidding auctions. The company processes millions of transactions every minute and manages terabytes of data daily. I led a team of engineers, ensuring the company's service operations ran smoothly 24/7/365.",
      "highlights": [
        "Reduced daily company-wide incident alerts from 200 to 5-10.",
        "Developed applications/modules in Python, Puppet (with Ruby), and SQL.",
        "Deployed and maintained applications in Amazon and Google cloud services.",
        "Implemented changes by coordinating with every team in the company.",
        "Created and integrated on-duty incident management procedures based on ITIL, which have been in use since then.",
        "Established a new team of eight people across three cities.",
        "Produced extensive documentation and recorded videos for internal education.",
        "Developed incident management stats gathering and visualization systems.",
        "Introduced several SRE concepts to the company."
      ]
    },
    {
      "name": "Svyaznoy Zagruzka",
      "position": "Senior System Engineer",
      "url": "https://www.en.zagruzka.com",
      "startDate": "2014-01-01",
      "endDate": "2015-01-31",
      "location": "Moscow",
      "summary": "Svyaznoy Zagruzka, a telecommunication content provider with approximately 40 employees, powers services for sending and receiving SMS messages and USSD requests for partners. I was responsible for client integration and support, and my daily activities included monitoring and troubleshooting applications and network investigations at the application level. I primarily wrote code in Bash, Perl, and Python to automate routine tasks.",
      "highlights": []
    },
    {
      "name": "Russian Federation Army",
      "position": "Compulsory military service",
      "url": "https://eng.mil.ru",
      "startDate": "2012-12-01",
      "endDate": "2013-12-01",
      "location": "Russia",
      "summary": "I completed one year of compulsory military service after obtaining my university degree."
    },
    {
      "name": "BioChemMack (medical equipment dealer)",
      "position": "System Engineer",
      "url": "https://biochemmack.ru/en/",
      "startDate": "2010-10-01",
      "endDate": "2012-12-01",
      "location": "Moscow",
      "summary": "BioChemMack, a company with seventy employees, resells medical equipment. I contributed by creating and populating a wiki with information about the internal infrastructure, migrating the primary server from an old CentOS version to Ubuntu, improving the company's network architecture, and providing technical support to medical equipment users."
    },
    {
      "name": "FS Group (metal reseller)",
      "position": "System Engineer",
      "url": "https://favor-group.ru/",
      "startDate": "2009-04-01",
      "endDate": "2010-10-01",
      "location": "Moscow",
      "summary": "As the sole IT professional at FS Group, a small multi-location metal reseller, I provided comprehensive IT services. My responsibilities included establishing network setups, creating documentation on the company infrastructure, participating in website development, SEO, and advertising. Later, I assisted the company in finding contractors for IT tasks and setting IT goals."
    }
  ],
  "education": [
    {
      "institution": "Synergy University",
      "area": "Information Security",
      "studyType": "Master's degree",
      "startDate": "2006-09-01",
      "endDate": "2012-06-01",
      "gpa": "",
      "location": "Moscow",
      "url": "https://synergy.ru/",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Programming",
      "keywords": [
        "Go",
        "Python",
        "TypeScript",
        "Microservices",
        "Algorithms and Data Structures"
      ]
    },
    {
      "name": "High Load",
      "keywords": [
        "Site Reliability Engineering",
        "Load Balancing",
        "Scalable and Reliable Systems",
        "Cost-effective Redundancy",
        "Automated Provisioning"
      ]
    },
    {
      "name": "Monitoring",
      "keywords": [
        "SRE Principles",
        "Analysis and Troubleshooting",
        "Establishing On-call Procedures",
        "Zabbix",
        "Bosun",
        "Prometheus"
      ]
    },
    {
      "name": "Scalable System Administration",
      "keywords": [
        "Linux Core Utils",
        "Infrastructure as Code",
        "Configuration Management",
        "Bash",
        "Ruby",
        "Puppet",
        "Terraform",
        "Docker",
        "Kubernetes",
        "Helm"
      ]
    },
    {
      "name": "Cloud Providers",
      "keywords": [
        "Amazon Web Services",
        "Google Cloud Platform",
        "Alibaba Cloud"
      ]
    },
    {
      "name": "Databases",
      "keywords": [
        "SQL",
        "MongoDB",
        "Local App Storage Engines"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent"
    },
    {
      "language": "Russian",
      "fluency": "Native Speaker"
    },
    {
      "language": "Dutch",
      "fluency": "Elementary"
    }
  ],
  "interests": [
    {
      "name": "Skydiving"
    }
  ]
}
